Repository: m8811163008/tandorost-platform
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fa

# username_in_use
source: The username '{user_name}' is already taken
fa: نام کاربری '{user_name}' قبلاً استفاده شده است

# welcome_message
source: Welcome, api uri : {api_uri}.
fa: خوش آمدید، آدرس API: {api_uri}.

# invalid_credentials
source: Could not validate credentials.
fa: اعتبارسنجی اطلاعات ورود انجام نشد.

# incorrect_credentials
source: Incorrect username or password
fa: نام کاربری یا رمز عبور اشتباه است

# remote_service_unavailable
source: Remote service is unavailable. try again
fa: سرویس راه دور در دسترس نیست. دوباره تلاش کنید

# user_registered
source: Wellcome, you registered successfully
fa: خوش آمدید، ثبت‌نام شما با موفقیت انجام شد

# rate_limit_reach
source: Request rate limit reached. Try {second} seconds later
fa: محدودیت تعداد درخواست‌ها رسید. {second} ثانیه بعد دوباره تلاش کنید

# username_not_registered_yet
source: Please first register phone number for verification code
fa: لطفاً ابتدا شماره تلفن را برای دریافت کد تأیید ثبت کنید

# invalid_verification_code
source: Verification code is invalid. Check verification code again.
fa: کد تأیید نامعتبر است. دوباره بررسی کنید.

# username_is_inactive
source: User name is inactive. Call support.
fa: نام کاربری غیرفعال است. با پشتیبانی تماس بگیرید.

# invalid_password
source: Invalid password.Check password or restore password
fa: رمز عبور نامعتبر است. رمز را بررسی یا بازیابی کنید

# password_restored
source: Password successfully restored.You can login.
fa: رمز عبور با موفقیت بازیابی شد. اکنون می‌توانید وارد شوید.

# invalid_token
source: Invalid json web token.
fa: توکن JSON Web نامعتبر است.

# user_not_found
source: Invalid user id.
fa: شناسه کاربر نامعتبر است.

source: Object not found.
fa: شیء پیدا نشد.

# verification_code_send
source: Verification code sent successfully.
fa: کد تأیید با موفقیت ارسال شد.

source: Invalid upload file request.
fa: درخواست بارگذاری فایل نامعتبر است.

# file_upload_failed
source: File upload failed. Please try again.
fa: بارگذاری فایل انجام نشد. لطفاً دوباره تلاش کنید.

# poor_quality
source: Image is blurry, pixelated, or low resolution.
fa: تصویر تار، پیکسلی یا با کیفیت پایین است.

# inappropriate_content
source: Image contains nudity, offensive material, or is otherwise inappropriate.
fa: تصویر شامل برهنگی، محتوای توهین‌آمیز یا نامناسب است.

# irrelevant_content
source: Image is not relevant to fitness or the intended purpose.
fa: تصویر مرتبط با تناسب اندام یا هدف مورد نظر نیست.

# cropped_or_obstructed
source: Key parts of the image are cropped, cut off, or obstructed.
fa: بخش‌های کلیدی تصویر بریده یا پوشانده شده‌اند.

# poor_lighting
source: Image is too dark, too bright, or has excessive shadows.
fa: تصویر بیش از حد تاریک، روشن یا دارای سایه زیاد است.

# unsafe_activity
source: Image depicts unsafe or potentially harmful activities.
fa: تصویر فعالیت‌های ناایمن یا بالقوه خطرناک را نشان می‌دهد.

# lack_of_consent
source: Image potentially includes individuals who have not consented to be shown.
fa: تصویر احتمالاً شامل افرادی است که رضایت برای نمایش ندارند.

# violates_guidelines
source: Image violates specific community guidelines or terms of service.
fa: تصویر با قوانین جامعه یا شرایط سرویس مغایرت دارد.

# file_format_unsupported
source: The uploaded file format is not supported.
fa: فرمت فایل بارگذاری شده پشتیبانی نمی‌شود.

# file_size_too_large
source: The uploaded file exceeds the maximum allowed file size.
fa: حجم فایل بارگذاری شده بیش از حد مجاز است.

# watermark_or_logo
source: Image contains visible watermarks or logos (if prohibited).
fa: تصویر دارای واترمارک یا لوگوی قابل مشاهده است (در صورت ممنوعیت).

# misleading_or_false
source: Image is misleading or falsely represents a fitness outcome or product.
fa: تصویر گمراه‌کننده یا نتیجه/محصول تناسب اندام را به‌درستی نشان نمی‌دهد.

# other_rejection_reason
source: Other reason not listed above.
fa: دلیل دیگری که در بالا ذکر نشده است.

# file_limit_exceeded
source: File size limit exceeded {file_size_limit}Mb.
fa: حجم فایل از حد مجاز {file_size_limit} مگابایت بیشتر است.

# invalid_argument
source: The request body is malformed. There is a typo, or a missing required field in your request. Check the API reference for request format, examples, and supported versions.
fa: بدنه درخواست ناقص یا اشتباه است. یک فیلد ضروری جا افتاده یا اشتباه تایپی وجود دارد. برای فرمت درخواست، مثال‌ها و نسخه‌های پشتیبانی شده به مستندات API مراجعه کنید.

# failed_precondition
source: Gemini API free tier is not available in your country. Please enable billing on your project in Google AI Studio. To use the Gemini API, you will need to set up a paid plan using Google AI Studio.
fa: نسخه رایگان Gemini API در کشور شما در دسترس نیست. لطفاً صورت‌حساب را در پروژه خود در Google AI Studio فعال کنید. برای استفاده از Gemini API باید یک طرح پولی راه‌اندازی کنید.

# permission_denied
source: Your API key doesn't have the required permissions. You are using the wrong API key; you are trying to use a tuned model without going through proper authentication. Check that your API key is set and has the right access.
fa: کلید API شما مجوزهای لازم را ندارد. کلید اشتباه است یا سعی دارید از مدل تنظیم‌شده بدون احراز هویت مناسب استفاده کنید. مطمئن شوید کلید API شما تنظیم و دارای دسترسی صحیح است.

# not_found
source: The requested resource wasn't found. An image, audio, or video file referenced in your request was not found. Check if all parameters in your request are valid for your API version.
fa: منبع درخواستی پیدا نشد. فایل تصویر، صوت یا ویدیوی ارجاع داده شده در درخواست شما یافت نشد. بررسی کنید همه پارامترها برای نسخه API شما معتبر باشند.

# resource_exhausted
source: You've exceeded the rate limit. You are sending too many requests per minute with the free tier Gemini API. Ensure you're within the model's rate limit. Request a quota increase if needed.
fa: محدودیت نرخ درخواست‌ها را رد کرده‌اید. تعداد درخواست‌های شما در دقیقه با نسخه رایگان Gemini API بیش از حد مجاز است. مطمئن شوید در محدوده مجاز مدل هستید. در صورت نیاز درخواست افزایش سهمیه دهید.

# internal_error
source: An unexpected error occurred on Google's side. Your input context is too long. Reduce your input context or temporarily switch to another model (e.g., from Gemini 1.5 Pro to Gemini 1.5 Flash) and see if it works. Or wait a bit and retry your request.
fa: خطای غیرمنتظره‌ای در سمت گوگل رخ داد. زمینه ورودی شما خیلی طولانی است. زمینه ورودی را کاهش دهید یا موقتاً به مدل دیگری (مثلاً از Gemini 1.5 Pro به Gemini 1.5 Flash) تغییر دهید و دوباره امتحان کنید. یا کمی صبر کنید و دوباره تلاش کنید.

# service_unavailable
source: The service may be temporarily overloaded or down. The service is temporarily running out of capacity. Temporarily switch to another model (e.g., from Gemini 1.5 Pro to Gemini 1.5 Flash) and see if it works. Or wait a bit and retry your request.
fa: سرویس ممکن است موقتاً بیش از حد بارگذاری شده یا قطع باشد. سرویس موقتاً ظرفیت کافی ندارد. موقتاً به مدل دیگری (مثلاً از Gemini 1.5 Pro به Gemini 1.5 Flash) تغییر دهید و دوباره امتحان کنید. یا کمی صبر کنید و دوباره تلاش کنید.

# deadline_exceeded
source: The service is unable to finish processing within the deadline. Your prompt (or context) is too large to be processed in time. Set a larger 'timeout' in your client request to avoid this error.
fa: سرویس قادر به پردازش درخواست در زمان مقرر نیست. درخواست یا زمینه شما برای پردازش در زمان کافی بزرگ است. برای جلوگیری از این خطا، مقدار 'timeout' را در درخواست خود افزایش دهید.
